In [3]:
import pandas as pd
df = pd.read_csv('salaries_by_college_major.csv')
df.head() # ctrl + enter to automatically print.

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [5]:
df.shape #(row, col)

(51, 6)

In [6]:
df.columns #columns name.

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [ ]:
df.isna() #check for NaN values.

In [8]:
df.tail() # 5 tail rows.

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [9]:
clean_df = df.dropna() #new data set without NaN values.
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [10]:
clean_df['Starting Median Salary']

0     46000.0
1     57700.0
2     42600.0
3     36800.0
4     41600.0
5     35800.0
6     38800.0
7     43000.0
8     63200.0
9     42600.0
10    53900.0
11    38100.0
12    61400.0
13    55900.0
14    53700.0
15    35000.0
16    35900.0
17    50100.0
18    34900.0
19    60900.0
20    38000.0
21    37900.0
22    47900.0
23    39100.0
24    41200.0
25    43500.0
26    35700.0
27    38800.0
28    39200.0
29    37800.0
30    57700.0
31    49100.0
32    36100.0
33    40900.0
34    35600.0
35    49200.0
36    40800.0
37    45400.0
38    57900.0
39    35900.0
40    54200.0
41    39900.0
42    39900.0
43    74300.0
44    50300.0
45    40800.0
46    35900.0
47    34100.0
48    36500.0
49    34000.0
Name: Starting Median Salary, dtype: float64

In [14]:
clean_df['Starting Median Salary'].max()

74300.0

In [15]:
clean_df['Starting Median Salary'].idxmax()

43

In [17]:
clean_df['Undergraduate Major'].loc[43] # == clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [18]:
clean_df.loc[43] #entire row

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [26]:
# âš¡ What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

major = clean_df.loc[clean_df['Mid-Career 10th Percentile Salary'].idxmax()]
print(f'College major has the highest mid-career salary: {major["Undergraduate Major"]}')
print(f'This major earn {major["Mid-Career 10th Percentile Salary"]} per year')

College major has the highest mid-career salary: Chemical Engineering
This major earn 71900.0 per year

In [28]:
# âš¡ Which college major has the lowest starting salary and how much do graduates earn after university?

major = clean_df.loc[clean_df['Starting Median Salary'].idxmin()]
print(f'College major has the lowest stating salary: {major["Undergraduate Major"]}')
print(f'This majors starting median salary is: {major["Starting Median Salary"]} per year')

College major has the lowest stating salary: Spanish
This majors starting median salary is: 34000.0 per year

In [31]:
# âš¡ Which college major has the lowest mid-career salary and how much can people expect to earn with this degree? 

major = clean_df.loc[clean_df['Mid-Career Median Salary'].idxmin()]
print(f'College major has the lowest mid-career salary: {major["Undergraduate Major"]}')
print(f'People can expect to earn: {major["Mid-Career 90th Percentile Salary"]} per year')

College major has the lowest mid-career salary: Education
People can expect to earn: 102000.0 per year

In [32]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col) #add new col named 'Spread' to [1] position.
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [35]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head() #display two col we need.

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

#### ðŸš¨ You can bring up the quick documentation with shift + tab on your keyboard directly in the Python notebook.

In [47]:
# âš¡ Find the degrees with the highest potential. Find the top 5 degrees with the highest values in the 90th percentile.

degree = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False) 
#Sort highest to lowest. (ascending=False)
print(f'The degree with the highest potential: \n- {degree.loc[0]["Undergraduate Major"]}')
print(f'Top 5 degrees with the highest potential: \n{degree[["Undergraduate Major", "Mid-Career 90th Percentile Salary"]].head()}')

The degree with the highest potential:
- Accounting
Top 5 degrees with the highest potential:
     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [51]:
# âš¡ The degrees with the greatest spread in salaries.

high_risk = low_risk.sort_values('Spread', ascending=False)
print(f"The degrees with the greatest spread in salaries: \n{high_risk[['Undergraduate Major', 'Spread']].head()}")

The degrees with the greatest spread in salaries:
   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [52]:
# âš¡ The degrees where the median salary is very high.

degrees = clean_df.sort_values('Mid-Career Median Salary', ascending=False)
print(f"The degrees where the median salary is very high: \n{degrees[['Undergraduate Major', 'Mid-Career Median Salary']].head()}")

The degrees where the median salary is very high:
       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

In [64]:
clean_df.groupby('Group').count()['Undergraduate Major']

Group
Business    12
HASS        22
STEM        16
Name: Undergraduate Major, dtype: int64

In [67]:
# âš¡ The average salary by group

clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

In [68]:
# Number formats in the Output

pd.options.display.float_format = '{:,.2f}'.format 
clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

### ðŸš¨ Note sumary.

- Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.
- Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.
- You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]
- You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]
- The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()
- You can sort the DataFrame with .sort_values() and add new columns with .insert()
- To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method